from django.apps import AppConfig
from django.db.models.signals import post_migrate
from django.db import models
from django.utils.translation import gettext_lazy as _

def create_initial_data(sender, **kwargs):
    from .models import TagGroups, Tag, Genres, Fandom, Country

    # Групи тегів
    tag_groups = {
        'Системи': None,
        'Інтриги та розвиток': None,
        'Стосунки та секс': None,
        'Герой': None,
        'Особливість персонажу': None,
        'Фентезі та магія': None,
        'Світи та Епохи': None,
    }
    
    for group_name in tag_groups:
        group, _ = TagGroups.objects.get_or_create(name=group_name)
        tag_groups[group_name] = group

    # Теги
    tags = [
        ('Магія', 'Фентезі та магія'),
        ('Темне фентезі', 'Фентезі та магія'),
        ('Темна магія', 'Фентезі та магія'),
        ('Демони', 'Фентезі та магія'),
        ('Дівчата монстри', 'Фентезі та магія'),
        ('Чарівники', 'Фентезі та магія'),
        ('Відьми', 'Фентезі та магія'),
        ('Вампіри', 'Фентезі та магія'),
        ('Янголи і демони', 'Фентезі та магія'),

        ('Гра зцілює життя', 'Системи'),
        ('Чорний гумор', 'Системи'),
        ('Система', 'Системи'),
        ('На реальних подіях', 'Системи'),
        ('Культивування', 'Системи'),
        ('Контроль розуму', 'Системи'),
        ('Ігрова система', 'Системи'),
        ('VRMMORPG', 'Системи'),

        ('', 'Інтриги та розвиток'),
        ('"Рояль у кущах"', 'Інтриги та розвиток'),
        ('Експеременти над людьми', 'Інтриги та розвиток'),
        ('Таємниці', 'Інтриги та розвиток'),
        ('Змови', 'Інтриги та розвиток'),
        ('Постійний розвиток персонажу', 'Інтриги та розвиток'),
        ('Інтриги', 'Інтриги та розвиток'),
        ('Заплутаний сюжет', 'Інтриги та розвиток'),
        ('Повільний розвиток сюжету', 'Інтриги та розвиток'),
        ('Швидкий розвиток сюжету', 'Інтриги та розвиток'),
        ('Альтернативний розвиток сюжету', 'Інтриги та розвиток'),
        ('Шантаж', 'Інтриги та розвиток'),
        ('Повсякденність', 'Інтриги та розвиток'),
        ('Дорослішання', 'Інтриги та розвиток'),

        ('18+', 'Стосунки та секс'),
        ('Свінгери', 'Стосунки та секс'),
        ('Підкорення', 'Стосунки та секс'),
        ('Зрада', 'Стосунки та секс'),
        ('Гарем', 'Стосунки та секс'),
        ('Зворотній гарем', 'Стосунки та секс'),
        ('БДСМ', 'Стосунки та секс'),
        ('ЛГБТ', 'Стосунки та секс'),
        ('Сімейні фантазії', 'Стосунки та секс'),
        ('Рогоносці', 'Стосунки та секс'),
        ('Міжрасовий секс', 'Стосунки та секс'),
        ('MILF', 'Стосунки та секс'),
        ('Геї', 'Стосунки та секс'),
        ('Лесбі', 'Стосунки та секс'),
        ('Трансгендер', 'Стосунки та секс'),

        ('Головний герой ідіот', 'Герой'),
        ('Головний герой каліка', 'Герой'),
        ('Головний герой психопат', 'Герой'),
        ('Головний герой наівний/невинний', 'Герой'),
        ('Головний герой злий', 'Герой'),
        ('Головний герой приховує свою силу', 'Герой'),
        ('Головний герой сильний із самого початку', 'Герой'),
        ('Головний герой неадекватний', 'Герой'),        
        ('Головний герой імба', 'Герой'),
        ('Головний герой збоченець', 'Герой'),
        ('Головний герой дівчина', 'Герой'),
        ('Головний герой амбітний', 'Герой'),
        ('Геніальний головний герой', 'Герой'),

        ('Мері Сью/Гері Сью', 'Особливість персонажу'),
        ('Удачливий головний герой', 'Особливість персонажу'),
        ('Герой зі слабкою силою', 'Особливість персонажу'),
        ('Антигерой', 'Особливість персонажу'),
        ('Антагоніст', 'Особливість персонажу'),
        ('Переродження', 'Особливість персонажу'),
        ('Амнезія', 'Особливість персонажу'),
        ('Суперздібності', 'Особливість персонажу'),


        ('Середньовіччя', 'Світи та Епохи'),
        ('Постапокаліпсис', 'Світи та Епохи'),
        ('Пекло і Рай', 'Світи та Епохи'),        
        ('Мультивсесвіт', 'Світи та Епохи'),
        ('Інші світи', 'Світи та Епохи'),
        ('Загублені світи', 'Світи та Епохи'),
        ('Космос', 'Світи та Епохи'),
    ]
    
    for tag_name, group_name in tags:
        Tag.objects.get_or_create(
            name=tag_name,
            group=tag_groups[group_name]
        )

    # Жанри
    genres = [
        'Фентезі',
        'Фантастика',
        'Уся(wuxia)',
        'Трилер',
        'Трагедія',
        'Сянься (XianXia)',
        'Сюаньхуань',
        'Сюаньхуа',
        'Сьонен',
        'Спорт',
        'Смат',
        'Сейненн',
        'Розширення',
        'Романтика',
        'Психологія',
        'Пригоди',
        'Пост-апокаліпсис',
        'Повсякденність',
        'Новела',
        'Надприроднє',
        'Наукова фантастика',
        'Містика',
        'Меха',
        'Мелодрама',
        'Махо-сьодзьо',
        'Любовний роман',
        'ЛітРПГ',
        'РеалРПГ',
        'Кіберпанк',
        'Комедія',
        'Історія',
        'Еротика',
        'Етті',
        'Екшен',
        'Драма',
        'Детектив',
        'Дитяча література',
        'Бойовик',
        'Романтика',
    ]
    
    for genre_name in genres:
        Genres.objects.get_or_create(name=genre_name)

    # Фендоми
    fandoms = [
        'Гаррі Поттер',
        'Наруто',
        'Володар Перснів',
        'Людина-павук',
        'Людина-мураха',
        'Marvel Universe',
        'DC Universe',
        'Star Wars',
        'Code Geass/Код Геіас',
        'One Piece',
        'Naruto',
        'Bleach',
        'One Punch Man',
        'Dragon Ball',
        'Бетмен',
        'Супермен',
        'Моя геройская академия',
        'Атака титанів',
    ]
    
    for fandom_name in fandoms:
        Fandom.objects.get_or_create(name=fandom_name)

    # Країни
    countries = [
        'інші країни Північної Америки',
        'інші країни Південної Америки',
        'інші країни Європи',
        'інші країни Африки',
        'інші країни Азії',
        'Японія',
        'Чеська Республіка',
        'Угорщина',
        'Італія',
        'Іспанія',
        'Франція',
        'Україна',
        'США',
        'Велика Британія',
        'Словаччина',
        'Білорусь',
        'Польща',
        'Німеччина',
        'Корея',
        'Китай',
        'Казахстан',
        'Італія',
        'Іспанія',
        'Франція',
        'Ірландія',
        'Єгипет',
        'Данія',
        'Греція',
        'Бразилія',
        'Австрія',
        'Австралія',
        'Японія',
    ]
    
    for country_name in countries:
        Country.objects.get_or_create(name=country_name)


class CatalogConfig(AppConfig):
    default_auto_field = 'django.db.models.BigAutoField'
    name = 'apps.catalog'
    verbose_name = _('Каталог')

    def ready(self):
        post_migrate.connect(create_initial_data, sender=self)